app/views/posts/show.html.erb

	<p><%= f.submit "Submit" %></p>
	<% @post.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]