app/controllers/comments_controller.rb

  def create
	  @post = Post.find(params[:post_id])
	  if user_signed_in?
		@comment = @post.comments.create!(params.require(:comment).permit!)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Test comment 1"], ["created_at", "2015-09-15 10:50:48.237593"], ["post_id", 1], ["updated_at", "2015-09-15 10:50:48.237593"]]